{
    "frameworks": [
        {
            "name": ".NET Framework",
            "icon_path": "",
            "experience": "I have been using the .NET framework for a couple of years now and would say it's the framework I am the most familiar with.  I have developed several programs using the .NET framework including console applications, WPF apps, a WCF app and a couple ASP.NET apps. I have also used the Entity Framework and LINQ to assit in creating some of my .NET applications."
        },
        {
            "name": "Angular",
            "icon_path": "",
            "experience": "I used the discontinued version of Angular, Angular JS,  for the front end of my capstone project at the request of my groups industry partner.  Having to use the older version of Angular made me want to try out the newer version as during my research for my capstone, most of the tutorials used the newer version. It looked like a far better developer experience so I made the website you're currently reading this on with Angular. I have enjoyed using Angular far more than using Angular JS.  Getting to use the CLI and having typescript available has felt like a more modern experience with less headaches.  I also prefer the Angular file structure. As a new user, it's easier to get up and running and keep everything organized."
        },
        {
            "name": "Express JS",
            "icon_path": "",
            "experience": "In my second year of school I wanted to learn a tech stack over the winter break.  I discovered the MEARN stack was fairly popular.  I ended up working on a CRUD type web app to teach myself.  During the process I used Express to handle the routing and to make requests to MongoDB.  Later on, during my capstone project, I used express as middleware to make queries on the database and to make requests to Grafana's API enabling the user to update embeded data visualizations."
        },
        {
            "name": "Ruby on Rails",
            "icon_path": "",
            "experience": "During the network applications and development course I took at Conestoga College, I followed and completed the entire book/screen cast series titled 'Ruby on Rails Tutorial: Learn Web Development with Rails' by Michael Hartl.  During the tutorial, I created a number of applications with the final application being a more substantial twitter type clone.  The clone had automated tests, user signup/login, account management and image uploading which was stored in an S3 bucket.  Additionally, the project was deployed using Heroku."
        }
    ],
    "markup_languages": [
        {

        }
    ],
    "languages": [
        {

        }
    ],
    "data_visualization_tools":[
        {
            "name": "Grafana",
            "icon_path": "",
            "experience": "For my capstone project, my group was tasked with integrating Grafana with Angular JS.  During this process, I programatically created dashboards in Grafana using their API and embeded the inviduals panels from the dashboard to our website.  To update the panels, the user could request different time spans of data, which was handled by sending requests which contained the entire JSON for the current dashboard and the updated SQL query representing the new time span to Grafana's API.  As a result of using Grafana in an obsecure way, I have a unusal knowledge of Grafana.  At my capstone projects demo day, one of the judges had used Grafana but had no idea that it could be used in the way we were using it."
        },
        {
            "name": "Tableau",
            "icon_path": "",
            "experience": "During my business intelligence course at Conestoga College, a couple of the assignments required using Tableau.  One of the assignments was loading covid-19 data into Tableau and displaying the various covid metrics using the global map data visualization and allowing the user to filter which countries/covid metrics they were currently viewing."
        },
        {
            "name": "Power BI",
            "icon_path": "",
            "experience": "During my business intelligence course at Conestoga College, I used power BI during a couple of labs.  During the course we were able to user power BI or Tableau for some of the assignments.  I prefered using Tableau so I am more familiar with Tableau than Power BI, but I have done some basics with it."
        },
        {
            "name": "MS Charts",
            "icon_path": "",
            "experience": "During my business intelligence course at Conestoga College, I used MS charts, a .NET library for a handful of assignments.  It gave me an appreciation for the power of data visualization tools such as Tableau and Grafana as writing C# code to make simple charts is far slower than using a GUI to connect to a datasource and populate aesthetically pleasing graphs.d"
        }
    ],
    "cloud_computing":[
        {
            "name": "Heroku",
            "icon_path": "",
            "experience": "I used Heroku to deploy the web application I created while I was completing the book/screen cast series titled 'Ruby on Rails Tutorial: Learn Web Development with Rails' by Michael Hartl."
        },
        {
            "name": "AWS",
            "icon_path": "",
            "experience": "I have used a number of services that AWS offers.  I have used S3 buckets for storing user uploaded images, IAM for managing access on a few assignments during my network application development and internet of things courses, IoT Core for connecting an AWS IoT Edukit to the cloud, SageMaker for training a simple machine learning model that my AWS IoT Edukit used.  Aditionally, I used EC2 and the cloud IDE while completing the book/screen cast series titled 'Ruby on Rails Tutorial: Learn Web Development with Rails' by Michael Hartl"
        },
        {
            "name": "Azure",
            "icon_path": "",
            "experience": "I have used Azure to host a couple of virtual machines including the virtual machine that was running the MySQL database and Grafana instance that my capstone project used."
        },
        {
            "name": "Google Cloud",
            "icon_path": "",
            "experience": "I used Google Cloud to configure OAuth 2.0 during my capstone project ensuring only a predefined set of users could access our website."
        }
    ]
}